Revit 2027 API
Mirror Class
 A static class that provides access to the property names that appear in the Mirror visual asset schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Mirror
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class Mirror
Public NotInheritable Class Mirror
public ref class Mirror abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Mirror = class end
The Mirror type exposes the following members.
Properties
Name | Description
CommonTintColor |  The property labeled "Tint Color" from the "Mirror" schema.
CommonTintToggle |  The property labeled "Tint" from the "Mirror" schema.
MirrorColorByObject |  The property labeled "Color By Object" from the "Mirror" schema.
MirrorTintcolor |  The property labeled "Color" from the "Mirror" schema.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace